#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖 Success! The configuration is valid.
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
Acquiring state lock. This may take a few moments...
random_string.af-name-noise: Refreshing state... [id=xjfxl]
random_password.af-sp-random-password: Refreshing state... [id=none]
azurerm_resource_group.af-rg: Refreshing state... [id=/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/continuous-validation-rg-xjfxl]
azurerm_app_service_plan.af-service-plan: Refreshing state... [id=/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/continuous-validation-rg-xjfxl/providers/Microsoft.Web/serverfarms/continuous-validation-service-plan-xjfxl]
azurerm_storage_account.af-sa: Refreshing state... [id=/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/continuous-validation-rg-xjfxl/providers/Microsoft.Storage/storageAccounts/cvsaxjfxl]
azurerm_function_app.af: Refreshing state... [id=/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/continuous-validation-rg-xjfxl/providers/Microsoft.Web/sites/pr-3-continuous-validation-xjfxl]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_application.af-application will be created
  + resource "azuread_application" "af-application" {
      + app_role                   = (known after apply)
      + application_id             = (known after apply)
      + available_to_other_tenants = false
      + homepage                   = (known after apply)
      + id                         = (known after apply)
      + identifier_uris            = (known after apply)
      + name                       = "continuous-validation-af-application-xjfxl"
      + oauth2_permissions         = (known after apply)
      + object_id                  = (known after apply)
      + owners                     = (known after apply)
      + prevent_duplicate_names    = false
      + public_client              = (known after apply)
      + reply_urls                 = (known after apply)
      + type                       = "webapp/api"
    }

  # azuread_service_principal.af-sp will be created
  + resource "azuread_service_principal" "af-sp" {
      + app_role_assignment_required = true
      + application_id               = (known after apply)
      + display_name                 = (known after apply)
      + id                           = (known after apply)
      + object_id                    = (known after apply)

      + oauth2_permissions {
          + admin_consent_description  = (known after apply)
          + admin_consent_display_name = (known after apply)
          + id                         = (known after apply)
          + is_enabled                 = (known after apply)
          + type                       = (known after apply)
          + user_consent_description   = (known after apply)
          + user_consent_display_name  = (known after apply)
          + value                      = (known after apply)
        }
    }

  # azuread_service_principal_password.af-sp-random-password will be created
  + resource "azuread_service_principal_password" "af-sp-random-password" {
      + description          = (known after apply)
      + end_date             = (known after apply)
      + end_date_relative    = "438000h"
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + service_principal_id = (known after apply)
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

  # azurerm_role_assignment.af-sp-role-assignment will be created
  + resource "azurerm_role_assignment" "af-sp-role-assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "contributor"
      + scope                            = "/subscriptions/e2a5adec-2d12-4bac-ad58-f7eac41fd498/resourceGroups/continuous-validation-rg-xjfxl/providers/Microsoft.Web/sites/pr-3-continuous-validation-xjfxl"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sdk-auth = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @MartinAnder, Action: `pull_request`, Working Directory: ``, Workflow: `Up`*